ip-rail/atmega-loco-firmware-lokbasis/uart.c
/*
 * these functions are only for ATmegas with four USART
 */
#if defined( ATMEGA_USART2 )

ISR(UART2_RECEIVE_INTERRUPT)
/*************************************************************************
Function: UART2 Receive Complete interrupt
Purpose:  called when the UART2 has received a character
**************************************************************************/
{
	uint16_t tmphead;
	uint8_t data;
	uint8_t usr;
	uint8_t lastRxError;


	/* read UART status register and UART data register */
	usr  = UART2_STATUS;
	data = UART2_DATA;

	/* */
	lastRxError = (usr & (_BV(FE2)|_BV(DOR2)) );

	/* calculate buffer index */
	tmphead = ( UART2_RxHead + 1) & UART_RX2_BUFFER_MASK;

	if ( tmphead == UART2_RxTail ) {
		/* error: receive buffer overflow */
		lastRxError = UART_BUFFER_OVERFLOW >> 8;
	} else {
		/* store new index */
		UART2_RxHead = tmphead;
		/* store received data in buffer */
		UART2_RxBuf[tmphead] = data;
	}
	UART2_LastRxError = lastRxError;
}


ISR(UART2_TRANSMIT_INTERRUPT)
/*************************************************************************
Function: UART2 Data Register Empty interrupt
Purpose:  called when the UART2 is ready to transmit the next byte
**************************************************************************/
{
	uint16_t tmptail;


	if ( UART2_TxHead != UART2_TxTail) {
		/* calculate and store new buffer index */
		tmptail = (UART2_TxTail + 1) & UART_TX2_BUFFER_MASK;
		UART2_TxTail = tmptail;
		/* get one byte from buffer and write it to UART */
		UART2_DATA = UART2_TxBuf[tmptail];  /* start transmission */
	} else {
		/* tx buffer empty, disable UDRE interrupt */
		UART2_CONTROL &= ~_BV(UART2_UDRIE);
	}
}


/*************************************************************************
Function: uart2_init()
Purpose:  initialize UART2 and set baudrate
Input:    baudrate using macro UART_BAUD_SELECT()
Returns:  none
**************************************************************************/
void uart2_init(uint16_t baudrate)
{
	UART2_TxHead = 0;
	UART2_TxTail = 0;
	UART2_RxHead = 0;
	UART2_RxTail = 0;


	/* Set baud rate */
	if ( baudrate & 0x8000 ) {
		UART2_STATUS = (1<<U2X2);  //Enable 2x speed
		baudrate &= ~0x8000;
	}
	UBRR2H = (uint8_t)(baudrate>>8);
	UBRR2L = (uint8_t) baudrate;

	/* Enable USART receiver and transmitter and receive complete interrupt */
	UART2_CONTROL = _BV(RXCIE2)|(1<<RXEN2)|(1<<TXEN2);

	/* Set frame format: asynchronous, 8data, no parity, 1stop bit */
#ifdef URSEL2
	UCSR2C = (1<<URSEL2)|(3<<UCSZ20);
#else
	UCSR2C = (3<<UCSZ20);
#endif
} /* uart_init */


/*************************************************************************
Function: uart2_getc()
Purpose:  return byte from ringbuffer
Returns:  lower byte:  received byte from ringbuffer
          higher byte: last receive error
**************************************************************************/
uint16_t uart2_getc(void)
{
	uint16_t tmptail;
	uint8_t data;

	if ( UART2_RxHead == UART2_RxTail ) {
		return UART_NO_DATA;   /* no data available */
	}

	/* calculate /store buffer index */
	tmptail = (UART2_RxTail + 1) & UART_RX2_BUFFER_MASK;
	UART2_RxTail = tmptail;

	/* get data from receive buffer */
	data = UART2_RxBuf[tmptail];

	return (UART2_LastRxError << 8) + data;

} /* uart2_getc */

/*************************************************************************
Function: uart2_peek()
Purpose:  Returns the next byte (character) of incoming UART data without
          removing it from the ring buffer. That is, successive calls to
		  uartN_peek() will return the same character, as will the next
		  call to uartN_getc()
Returns:  lower byte:  next byte in ring buffer
          higher byte: last receive error
**************************************************************************/
uint16_t uart2_peek(void)
{
	uint16_t tmptail;
	uint8_t data;


	if ( UART2_RxHead == UART2_RxTail ) {
		return UART_NO_DATA;   /* no data available */
	}

	tmptail = (UART2_RxTail + 1) & UART_RX2_BUFFER_MASK;

	/* get data from receive buffer */
	data = UART2_RxBuf[tmptail];

	return (UART2_LastRxError << 8) + data;

} /* uart2_peek */

/*************************************************************************
Function: uart2_putc()
Purpose:  write byte to ringbuffer for transmitting via UART
Input:    byte to be transmitted
Returns:  none
**************************************************************************/
void uart2_putc(uint8_t data)
{
	uint16_t tmphead;


	tmphead  = (UART2_TxHead + 1) & UART_TX2_BUFFER_MASK;

	while ( tmphead == UART2_TxTail ) {
		;/* wait for free space in buffer */
	}

	UART2_TxBuf[tmphead] = data;
	UART2_TxHead = tmphead;

	/* enable UDRE interrupt */
	UART2_CONTROL    |= _BV(UART2_UDRIE);

} /* uart2_putc */


/*************************************************************************
Function: uart2_puts()
Purpose:  transmit string to UART2
Input:    string to be transmitted
Returns:  none
**************************************************************************/
void uart2_puts(const char *s )
{
	while (*s)
		uart2_putc(*s++);

} /* uart2_puts */


/*************************************************************************
Function: uart2_puts_p()
Purpose:  transmit string from program memory to UART2
Input:    program memory string to be transmitted
Returns:  none
**************************************************************************/
void uart2_puts_p(const char *progmem_s )
{
	register char c;

	while ( (c = pgm_read_byte(progmem_s++)) ) {
		uart2_putc(c);
	}

} /* uart2_puts_p */



/*************************************************************************
Function: uart2_available()
Purpose:  Determine the number of bytes waiting in the receive buffer
Input:    None
Returns:  Integer number of bytes in the receive buffer
**************************************************************************/
uint16_t uart2_available(void)
{
	return (UART_RX2_BUFFER_SIZE + UART2_RxHead - UART2_RxTail) & UART_RX2_BUFFER_MASK;
} /* uart2_available */



/*************************************************************************
Function: uart2_flush()
Purpose:  Flush bytes waiting the receive buffer.  Acutally ignores them.
Input:    None
Returns:  None
**************************************************************************/
void uart2_flush(void)
{
	UART2_RxHead = UART2_RxTail;
} /* uart2_flush */

#endif

#endif /* defined( USART2_ENABLED ) */

#if defined( USART3_ENABLED )

