ip-rail/atmega-loco-firmware-lokbasis/uart.c
/*
 * these functions are only for ATmegas with four USART
 */
#if defined( ATMEGA_USART3 )

ISR(UART3_RECEIVE_INTERRUPT)
/*************************************************************************
Function: UART3 Receive Complete interrupt
Purpose:  called when the UART3 has received a character
**************************************************************************/
{
	uint16_t tmphead;
	uint8_t data;
	uint8_t usr;
	uint8_t lastRxError;


	/* read UART status register and UART data register */
	usr  = UART3_STATUS;
	data = UART3_DATA;

	/* */
	lastRxError = (usr & (_BV(FE3)|_BV(DOR3)) );

	/* calculate buffer index */
	tmphead = ( UART3_RxHead + 1) & UART_RX3_BUFFER_MASK;

	if ( tmphead == UART3_RxTail ) {
		/* error: receive buffer overflow */
		lastRxError = UART_BUFFER_OVERFLOW >> 8;
	} else {
		/* store new index */
		UART3_RxHead = tmphead;
		/* store received data in buffer */
		UART3_RxBuf[tmphead] = data;
	}
	UART3_LastRxError = lastRxError;
}


ISR(UART3_TRANSMIT_INTERRUPT)
/*************************************************************************
Function: UART3 Data Register Empty interrupt
Purpose:  called when the UART3 is ready to transmit the next byte
**************************************************************************/
{
	uint16_t tmptail;


	if ( UART3_TxHead != UART3_TxTail) {
		/* calculate and store new buffer index */
		tmptail = (UART3_TxTail + 1) & UART_TX3_BUFFER_MASK;
		UART3_TxTail = tmptail;
		/* get one byte from buffer and write it to UART */
		UART3_DATA = UART3_TxBuf[tmptail];  /* start transmission */
	} else {
		/* tx buffer empty, disable UDRE interrupt */
		UART3_CONTROL &= ~_BV(UART3_UDRIE);
	}
}


/*************************************************************************
Function: uart3_init()
Purpose:  initialize UART3 and set baudrate
Input:    baudrate using macro UART_BAUD_SELECT()
Returns:  none
**************************************************************************/
void uart3_init(uint16_t baudrate)
{
	UART3_TxHead = 0;
	UART3_TxTail = 0;
	UART3_RxHead = 0;
	UART3_RxTail = 0;

	/* Set baud rate */
	if ( baudrate & 0x8000 ) {
		UART3_STATUS = (1<<U2X3);  //Enable 2x speed
		baudrate &= ~0x8000;
	}
	UBRR3H = (uint8_t)(baudrate>>8);
	UBRR3L = (uint8_t) baudrate;

	/* Enable USART receiver and transmitter and receive complete interrupt */
	UART3_CONTROL = _BV(RXCIE3)|(1<<RXEN3)|(1<<TXEN3);

	/* Set frame format: asynchronous, 8data, no parity, 1stop bit */
#ifdef URSEL3
	UCSR3C = (1<<URSEL3)|(3<<UCSZ30);
#else
	UCSR3C = (3<<UCSZ30);
#endif
} /* uart_init */


/*************************************************************************
Function: uart3_getc()
Purpose:  return byte from ringbuffer
Returns:  lower byte:  received byte from ringbuffer
          higher byte: last receive error
**************************************************************************/
uint16_t uart3_getc(void)
{
	uint16_t tmptail;
	uint8_t data;

	if ( UART3_RxHead == UART3_RxTail ) {
		return UART_NO_DATA;   /* no data available */
	}

	/* calculate /store buffer index */
	tmptail = (UART3_RxTail + 1) & UART_RX3_BUFFER_MASK;
	UART3_RxTail = tmptail;

	/* get data from receive buffer */
	data = UART3_RxBuf[tmptail];

	return (UART3_LastRxError << 8) + data;

} /* uart3_getc */

/*************************************************************************
Function: uart3_peek()
Purpose:  Returns the next byte (character) of incoming UART data without
          removing it from the ring buffer. That is, successive calls to
		  uartN_peek() will return the same character, as will the next
		  call to uartN_getc()
Returns:  lower byte:  next byte in ring buffer
          higher byte: last receive error
**************************************************************************/
uint16_t uart3_peek(void)
{
	uint16_t tmptail;
	uint8_t data;

	if ( UART3_RxHead == UART3_RxTail ) {
		return UART_NO_DATA;   /* no data available */
	}

	tmptail = (UART3_RxTail + 1) & UART_RX3_BUFFER_MASK;

	/* get data from receive buffer */
	data = UART3_RxBuf[tmptail];

	return (UART3_LastRxError << 8) + data;

} /* uart3_peek */

/*************************************************************************
Function: uart3_putc()
Purpose:  write byte to ringbuffer for transmitting via UART
Input:    byte to be transmitted
Returns:  none
**************************************************************************/
void uart3_putc(uint8_t data)
{
	uint16_t tmphead;


	tmphead  = (UART3_TxHead + 1) & UART_TX3_BUFFER_MASK;

	while ( tmphead == UART3_TxTail ) {
		;/* wait for free space in buffer */
	}

	UART3_TxBuf[tmphead] = data;
	UART3_TxHead = tmphead;

	/* enable UDRE interrupt */
	UART3_CONTROL    |= _BV(UART3_UDRIE);

} /* uart3_putc */


/*************************************************************************
Function: uart3_puts()
Purpose:  transmit string to UART3
Input:    string to be transmitted
Returns:  none
**************************************************************************/
void uart3_puts(const char *s )
{
	while (*s) {
		uart3_putc(*s++);
	}

} /* uart3_puts */


/*************************************************************************
Function: uart3_puts_p()
Purpose:  transmit string from program memory to UART3
Input:    program memory string to be transmitted
Returns:  none
**************************************************************************/
void uart3_puts_p(const char *progmem_s )
{
	register char c;

	while ( (c = pgm_read_byte(progmem_s++)) ) {
		uart3_putc(c);
	}

} /* uart3_puts_p */



/*************************************************************************
Function: uart3_available()
Purpose:  Determine the number of bytes waiting in the receive buffer
Input:    None
Returns:  Integer number of bytes in the receive buffer
**************************************************************************/
uint16_t uart3_available(void)
{
	return (UART_RX3_BUFFER_SIZE + UART3_RxHead - UART3_RxTail) & UART_RX3_BUFFER_MASK;
} /* uart3_available */



/*************************************************************************
Function: uart3_flush()
Purpose:  Flush bytes waiting the receive buffer.  Acutally ignores them.
Input:    None
Returns:  None
**************************************************************************/
void uart3_flush(void)
{
	UART3_RxHead = UART3_RxTail;
} /* uart3_flush */

#endif

#endif /* defined( USART3_ENABLED ) */
